BUILD/build_api/statics/request_body_template.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<SOAP-ENV:Body>
  <typens:tanium_soap_request xmlns:typens="urn:TaniumSOAP">
    <session>{0}</session>
    <command>{1}</command>
    <object_list>
      {2}
    </object_list>
    <options>
      <flags>{flags}</flags>
      <hide_errors_flag>{hide_errors_flag}</hide_errors_flag>
      <include_answer_times_flag>{include_answer_times_flag}</include_answer_times_flag>
      <row_counts_only_flag>{row_counts_only_flag}</row_counts_only_flag>
      <aggregate_over_time_flag>{aggregate_over_time_flag}</aggregate_over_time_flag>
      <most_recent_flag>{most_recent_flag}</most_recent_flag>
      <include_hashes_flag>{include_hashes_flag}</include_hashes_flag>
      <hide_no_results_flag>{hide_no_results_flag}</hide_no_results_flag>
      <use_user_context_flag>{use_user_context_flag}</use_user_context_flag>
      <script_data>{script_data}</script_data>
      <return_lists_flag>{return_lists_flag}</return_lists_flag>
      <return_cdata_flag>{return_cdata_flag}</return_cdata_flag>
      <pct_done_limit>{pct_done_limit}</pct_done_limit>
      <context_id>{context_id}</context_id>
      <sample_frequency>{sample_frequency}</sample_frequency>
      <sample_start>{sample_start}</sample_start>
      <sample_count>{sample_count}</sample_count>
      <suppress_scripts>{suppress_scripts}</suppress_scripts>
      <suppress_object_list>{suppress_object_list}</suppress_object_list>
      <row_start>{row_start}</row_start>
      <row_count>{row_count}</row_count>
      <sort_order>{sort_order}</sort_order>
      <filter_string>{filter_string}</filter_string>
      <filter_not_flag>{filter_not_flag}</filter_not_flag>
      <recent_result_buckets>{recent_result_buckets}</recent_result_buckets>
      <cache_id>{cache_id}</cache_id>
      <cache_expiration>{cache_expiration}</cache_expiration>
      <cache_sort_fields>{cache_sort_fields}</cache_sort_fields>
      <include_user_details>{include_user_details}</include_user_details>
      <include_hidden_flag>{include_hidden_flag}</include_hidden_flag>
      <use_error_objects>{use_error_objects}</use_error_objects>
      <use_json>{use_json}</use_json>
      <json_pretty_print>{json_pretty_print}</json_pretty_print>
      <cache_filters/>
    </options>
  </typens:tanium_soap_request>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
